{
  "documents" : [
    {
      "header" : "Apartments Booking",
      "title" : {
        "header" : "Apartments Booking",
        "content" : "<h2>Proposal</h2><table class=\"table table-bordered\"><tr><td>Customer<td><tr><td>Customer contact person<td><tr><td>ScienceSoft contact person<td><b>Aliaksei Ivashka, Sales Department</b><br>ScienceSoft - Professional Software Development<br>HQ: 5900 S. Lake Forest Drive, Suite 300, McKinney, TX 75070, USA<br>P +1 214 306 68 37 ext 440<br><a>amaley@scnsoft.com</a><br>www.scnsoft.com<tr><td>Proposal date<td>June 16, 2016<tr><td>Valid date<td>June 16, 2016</table>"
      },
      "contents" : {
        "header" : "Contens",
        "content" : "<h2>Contents</h2><ol><li><span>INTRODUCTION</span><span>3</span><ul><li><span>STATEMENTS AND CONFIRMATIONS, CONFIDENTIALITY</span><span>3</span></li></ul></li></ol>"
      },
      "introduction" : {
        "header" : "Introduction",
        "content" : "<p>The aim of this Document is to present the technical and commercial aspects of our Proposal created in response to the request received on February 17, 2016, as well as to position ScienceSoft as a reliable long-term business partner.<p>The document consists of 3 sections:<ul><li>INTRODUCTION contains the description of the present Proposal<li>TECHNICAL PROPOSAL introduces the assumptions underlying the proposed solution; description of the conceptual system model; technologies that are going to be used during the project<li>COMMERCIAL PROPOSAL describes key features of the proposal contracting model and provides the payment details and schedule.</ul><p>The Proposal also includes Appendixes covering typical questions regarding ScienceSoft’s key processes as well as to providing additional reference information.<h5>STATEMENTS AND CONFIRMATIONS, CONFIDENTIALITY</h5><p>Describes the conditions and liability of both parts, including statements of confidentiality:<p>By making this proposal ScienceSoft Oy (the “Vendor”), whose principal office is situated at 5900 S. Lake Forest Drive, Suite 300, McKinney, TX 75070, USA agrees to the following statements:<ul><li>ScienceSoft makes a voluntary proposal to perform the services described in the project development plan enclosed to the current document.<li>This Proposal does not constitute a contract.<li>ScienceSoft ensures confidentiality of any information about the project and its parts to the extent required by the Customer. Details on how confidential information is handled are addressed in the Non-disclosure Agreement<li>The prices and schedule stated in the proposal document are not final and subject to changes after the customer provides the “Detailed requirements specification” or in case the customer changes initial requirements or some new requirements appear before the completion of the project<li>The Proposal remains valid till June 16, 2016</ul>"
      },
      "technicalProposal" : {
        "header" : "Technical Proposal",
        "content" : "<h4>2.1. PROJECT GOAL</h4> <p>The main goal of the Project is to design, develop and test a new web-based Order Management System for Primetime Sports Apparel as per flow charts provided by the Customer on July 13th 2016. Order Management System helps to organize process of cooperation between customers, sale managers, production department and finance / accounting department. </p><h4>2.2. SCOPE OF WORK</h4> <p>The project envisages the following scope of works: </p><ol> <li>Design and development of new web-based Order Management System</li><li>Testing of new web-based Order Management System</li><li>Deployment live of new web-based Order Management System</li></ol> <p>As the result, ScienceSoft will deliver to the Customer a turnkey solution. </p><p>Primetime Sports Apparel is a web application, CRM system, which</p><h4>2.3. OUT OF THE SCOPE OF WORK</h4> <p>Web store (information catalog) is not included in the scope of this project.</p><h4>2.4. FUNCTIONALITY OF THE WEB-BASED ORDER MANAGEMENT SYSTEM</h4> <p>Functionality and features of the future web-based Order Management System are described in the functional map below: </p><img class=\"img-responsive\" src=\"img/scheme2.png\" alt=\"functionality scheme\"> <p>Functional map is also attached to this proposal as a separate file. </p><h4>2.5. ARCHITECTURE</h4> <p>The architecture of the future web-based Order Management System is described in the scheme below: </p><img class=\"img-responsive\" src=\"img/architecture.png\" alt=\"Primetime Sports Apparel Architecture\"> <h4>2.6. Technologies</h4> <p>The following technologies and tools will be used to develop the web-based Order Management System:</p><table class=\"table table-bordered text-center\"> <tbody><tr> <th class=\"text-center\">Server Side</th> <td> <ul> <li>OroCRM</li><li>Symfony 2 (Open Source Framework)</li><li>Backend: PHP5.6, Linux (Debian 8), Nginx, MySQL 5</li></ul> </td></tr><tr> <th class=\"text-center\">Frontend</th> <td>Twitter bootstrap, HTML5/CSS3, JavaScript, jQuery, jQuery UI </td></tr></tbody></table> <h4>2.7. OPEN SOURCE LICENSES</h4> <table class=\"table table-striped table-bordered\"> <tbody><tr> <th class=\"text-uppercase text-center\">Technology &amp; TOOLS</th> <th class=\"text-uppercase text-center\">Open Source Library</th> <th class=\"text-uppercase text-center\">Licensing</th> </tr><tr> <td>Symfony 2</td><td>Symfony 2 Open Source Enterprise framework</td><td>Open Source<br><a href=\"http://symfony.com/doc/current/contributing/code/license.html\">http://symfony.com/doc/current/contributing/code/license.html </a> </td></tr><tr> <td>Database Field</td><td>Symfony Doctrine2 covers database integration</td><td>Open Source<br><a href=\"https://github.com/doctrine/DoctrineBundle/blob/master/LICENSE\">https://github.com/doctrine/DoctrineBundle/blob/master/LICENSE</a> </td></tr><tr> <td>Dynamic Responsive Admin Template</td><td> <a href=\"https://almsaeedstudio.com/themes/AdminLTE/pages/UI/general.html\">https://almsaeedstudio.com/themes/AdminLTE/pages/UI/general.html</a><br>(Not open source but provided by customer) </td><td>Open Source MIT<br><a href=\"https://github.com/almasaeed2010/AdminLTE/blob/master/LICENSE\">https://github.com/almasaeed2010/AdminLTE/blob/master/LICENSE</a> </td></tr><tr> <td>OroCRM Community</td><td><a href=\"https://www.orocrm.com/oro-platform\">https://www.orocrm.com/oro-platform </a></td><td>Open Source</td></tr></tbody></table> <h5><b>SPECIAL NOTES:</b></h5> <ul> <li>1. To achieve the goal of the Project and to be commercial effective it’s necessary to use Open Source stack of technologies and frameworks integrating them in a single application that will cover all the back-end requirements in terms of security, flexibility, high availability and monitoring. </li><li>2. Symfony2 framework and OroCRM ideally fit the desired functionality of the Order Management System, because they offer comprehensive possibilities for code maintenance and adding new features with enterprise level code quality and stability. </li></ul> <h4>2.8. ASSUMPTIONS</h4> <h5>DESIGN AND DEVELOPMENT ASSUMPTIONS</h5> <ul> <li>1. A Project Manager will be provided by ScienceSoft. Project Manager is included into this proposal. </li><li>2. There will be an expert / representative on the Customer's side, available for communication via Skype or phone. </li><li>3. System/Application Design and Modelling stage will be completed before the implementation starts. </li><li>4. The System’s design will be responsive and support Desktop, Tablets (480px) and Mobile devices (320px). </li><li>5. OroCRM will be used as a platform for server and web admin console. </li><li>6. Customer will provide MailChimp or Mandrill account for the System to be integrated with. </li><li>7. The Customer will provide a dedicated server for the System deployment. Possible options for deployment are Amazon Cloud or Digital Ocean. Expected cost for hosting is around 300$ per month. </li><li>8. The System will support English only. </li><li>9. The Customer will provide access for all the 3rd parties’ services and systems with a description of API (for example, Google Analytics or Mandrill or Mailchimp). </li><li>10. The Customer will provide templates for emails and invoices. The information is entered into invoices manually. </li><li>11. Customer will provide a description of workflows for each role. </li><li>12. Stripe will be integrated as the payment processing system. </li><li>13. Livehelperchat (<a href=\"https://livehelperchat.com/\">https://livehelperchat.com/</a>) will be used asa livechat. </li><li>14. The present proposal may be reviewed after Design and Modelling Stage, if any substantial modifictions into functionality and features are introduced by the Customer. </li></ul> <h5>TESTING ASSUMPTIONS</h5> <ul> <li>15. Functional Requirements Specification will not be changed once it is approved by the Customer. </li><li>16. Check list is designed and used for testing activities. </li><li>17. The proposal includes functional testing of the portal on one of Desktop configuration (Win + latest version of a browser – to be defined), one Tablet and one Mobile devices. Performance verification or load tests are not included into the present proposal. </li><li>18. We assume that the acceptance tests conducted by the Customer will last not more than 10 calendar days. We assume that acceptance test plan and check list should be agreed in advance both by customer and SceinceSoft. </li></ul> <h4>2.9. DEVELOPMENT STAGES AND PROJECT SCHEDULE</h4> <table class=\"table table-striped table-bordered\"> <tbody><tr> <th class=\"text-center\">No</th> <th class=\"text-center\">STAGE</th> <th class=\"text-center\">DESCRIPTION</th> <th class=\"text-center\">START</th> <th class=\"text-center\">FINISH</th> </tr><tr> <td><b>1</b></td><td>Design and Modelling stage</td><td><ul> <li>1. Building the architecture</li><li>2. Finalization of Functional Requirements Specification and its review by the Customer</li><li>3. Development of test plan and check list</li></ul> </td><td>Aug 1, 2016</td><td>Aug 15, 2016</td></tr><tr> <td><b>2</b></td><td>Development Stage </td><td>Implementation of the Order Management System (coding, database structuring, source code in GIT repository)</td><td>Aug 15, 2016</td><td>Sep 20, 2016</td></tr><tr> <td><b>3</b></td><td>Stabilization / Testing</td><td><ol> <li>Pre-deployment testing consisting of: <ul><li>Functional Testing</li></ul> </li><li>2. Bug fixing (if any) and verification of fixed bugs</li><li>3. The verified source code will be deployed on Sciencesoft's server</li></ol> </td><td>Sep 20, 2016</td><td>Oct 11, 2016</td></tr><tr> <td><b>4</b></td><td><i>Acceptance test by the Customer</i></td><td><i>Acceptance test is conducted as per test plans and check list coordinated between ScienceSoft and the Customer in the course of Design and Modelling Stage. We assume that the acceptance tests conducted by the Customer will last not more than 10 calendar days. Upon completion of Acceptance test a bug report will be generated (if any bugs are identified).</i>&gt; </td><td><i>Oct 11, 2016</i></td><td><i>Oct 21, 2016</i></td></tr><tr> <td><b>4.1.</b></td><td>Post-acceptance bug fixing (if any)</td><td>If any bugs are identified in the course of acceptance, ScienceSoft will duly eliminate them at the soonest.</td><td>Oct 21, 2016</td><td>Oct 26, 2016</td></tr><tr> <td><b>5</b></td><td>Deployment Stage</td><td>Deployment of the Order Management System on the Customer’s server</td><td>Oct 26, 2016</td><td>Oct 28, 2016</td></tr></tbody></table> <p>* Dates are stated for illustration of the time required to complete the tasks.</p><h4>2.10. UI Samples of the Order Management System (FOR DEMONSTRATION)</h4> <h5 class=\"text-center\"><b>Dashboard with Testing / Demo Data</b></h5> <img src=\"img/dashboard.png\" alt=\"Dashboard with Testing\" class=\"img-responsive\"> <h5 class=\"text-center\"><b>Workflows Screen</b></h5> <img src=\"img/workflow.png\" alt=\"Workflows Screen\" class=\"img-responsive\"> <h5 class=\"text-center\"><b>List of Accounts</b></h5> <img src=\"img/accounts.png\" alt=\"List of Accounts\" class=\"img-responsive\"> <h5 class=\"text-center\"><b>Edit Form Screen</b></h5> <img src=\"img/edit.png\" alt=\"Edit Form Screen\" class=\"img-responsive\"> <p>All Screens are attached to this Proposal as a separate files for better visualization. </p>"
      },
      "comercialProposal" : {
        "header" : "Comercial Proposal",
        "content" : "<h5>Model of cooperation</h5><p>As a base pricing/contractual model for the present engagement we suggest a Time & Material model of cooperation. In this case the \"full time equivalent\" scheme is applied, which means that the Customer is charged at an hourly rate for each employee dedicated to the customer's project. All invoices for this type of contract are accompanied by project reports.  This model is recommended for projects which are dynamic and have fluidity. It provides the customer with maximum control over deliverables and the team which works on the project. For payment, a \"full time equivalent\" scheme is applied which means that an hourly rate is charged for each employee dedicated to the project. All invoices for this type of contract are accompanied by project reports.<h5>Schedule and milestones</h5><p>Project milestones (start date is set to Jul 18, 2016)<table class=\"table table-bordered\"><thead><tr class=info><th>Название задачи<th>Work<th>Duration<th>Start<th>Finish<tbody><tr><td>Apartment booking portal<td>1 300 h<td>93 days<td>Mon 18.07.16<td>Wed 23.11.16<tr><td>Milestones<td>0 h<td>92 days<td>Mon 18.07.16<td>Tue 22.11.16<tr><td>Project Administration<td>70 h<td>87,5 days<td>Mon 18.07.16<td>Wed 16.11.16<tr><td>Modelling & Design<td>172 h<td>7,5 days<td>Mon 18.07.16<td>Wed 27.07.16<tr><td>Implementation<td>686 h<td>44 days<td>Wed 27.07.16<td>Tue 27.09.16<tr><td>Stabilization<td>316 h<td>28,5 days<td>Tue 27.09.16<td>Fri 04.11.16<tr><td>Acceptance<td>40 h<td>11 days<td>Mon 07.11.16<td>Mon 21.11.16<tr><td>Deploy<td>16 h<td>2 days<td>Tue 22.11.16<td>Wed 23.11.16</table><p>For a detailed project schedule, please refer to the file estimation.pdf"
      },
      "aboutScnsoft" : {
        "header" : "About Scnsoft",
        "content" : "<h5>Overview</h5><p>ScienceSoft is an international software development and consulting company with headquarters in the USA (McKinney, Texas) and development centers in Eastern Europe and Asia. Bringing in 450 experts and 27 years of IT business experience, ScienceSoft is a partner of IBM, Microsoft and Oracle. The company has been serving such customers as eBay, PerkinElmer, IBM and many others. ScienceSoft’s achievements in 2014 show its persistent business growth and expansion across the globe:<ul><li>Over 100 active clients in 30 countries<li>15% revenue growth compared to 2014<li>62% revenue growth in the USA/Canada region</ul><h5>Industries</h5><p>ScienceSoft has been delivering software solutions for middle-market and enterprise customers across multiple target industries. Among our selected projects there have been:<ul><li><b>Banking and Finance:</b><ul><li>СRM for a bank with <b>7 mln clients</b><li><a>Award-winning</a> mobile banking solutions<li>Intranet portal for a bank with over <b>$400 bln assets</b><li>Information security projects for financial institutions on three continents</ul><li><b>Healthcare:</b><ul><li>Business intelligence for <b>200 US healthcare centers</b><li>Medication order processing system for a US healthcare company with more than <b>$15 bln revenue</b> and <b>60,000 employees</b></ul><li><b>Retail:</b><ul><li>Modules for one of <b>eBay’</b>s e-Commerce platforms with over <b>2.5 mln members</b><li>Private label product analysis and reporting used by Wal-Mart<li>Trade promotion management solution used by Heinz<li>Brand health monitoring system used by Nestle</ul><li><b>Telecom:</b><ul><li><b>Viber</b>, one of the world’s most popular instant messaging and VoIP apps with <b>570 mln users</b><li>Information security projects for telecoms in Europe and Asia</ul><li><b>Public Sector:</b><ul><li>Nationwide civil registry for a EU country<li>Mobile document management solution for a parliament</li><p>We have also built up experience in Education, Manufacturing, Energy, Media and Entertainment, Transportation and Logistics.</ul></ul><h5>Project management</h5><p>With an established project management culture, ScienceSoft has achieved <b>100% project delivery</b> owing to:<ul><li>ability to work with both detailed and vague project scope<li>realistic estimation and, thus, staying within budget during implementation<li>effective resource allocation to lessen risks<li>being able to apply various software development methodologies<li>ensuring smooth communication with the Customer and 3rd parties<li>all-round Quality Assurance to guarantee that the application runs as intended</ul><h5>Technical and consulting competencies</h5><p>ScienceSoft’s offering embraces the full cycle of custom software development, platform-based consulting, and IT services:<ul><li><b>Custom application development</b><ul><li>Web application development: server-side and user interface<li>Mobile app development: native (iOS, Android and Windows Phones) and cross-platform</ul><li><b>Platform-based solutions:</b> Microsoft Dynamics CRM, Microsoft SharePoint, SAP, IBM Cognos and many more<li><b>Web development:</b> portals, web apps and e-Commerce solutions built on Drupal, WordPress, Joomla, Pimcore, Magento and other platforms<li><b>Data analysis: </b>data warehousing, reporting and visualization, and predictive analytics<li><b>Security intelligence:</b> penetration testing, security information and event management (SIEM), identity and access management (IAM) and compliance<li><b>Acceptance testing</b><li><b>Software maintenance </b>(fixing defects and creating new features)</ul><h5>Brief company history</h5><p><b>1989, April</b> – ScienceSoft is founded as a computer-aided innovation software company<p><b>1991-2004 </b>– ScienceSoft matures as an exclusive software development partner of Invention Machine Corporation (now part of IHS), creating solutions and products that powered 40% of Fortune 500 companies<p><b>2009 </b>– ScienceSoft becomes IBM Core Supplier for Technical Services and Microsoft Gold Certified Partner<p><b>2010, August-present </b>– ScienceSoft helps create <b>Viber</b><p><b>2015 </b>– ScienceSoft starts serving <b>eBay</b>"
      }
    },
    {
      "header" : "Apartments Booking 2",
      "title" : {
        "header" : "Apartments Booking 2",
        "content" : "Proposal"
      },
      "contents" : {
        "header" : "<h4>Contens</h4>",
        "contnent" : "<h2>Contents</h2><ol><li><span>INTRODUCTION</span><span>3</span><ul><li><span>STATEMENTS AND CONFIRMATIONS, CONFIDENTIALITY</span><span>3</span></li></ul></li></ol>"
      },
      "introduction" : "Introduction",
      "technicalProposal" : "<p>I am a technical-proposal<p>",
      "comercialProposal" : "<p>I am a comercial-proposal<p>",
      "aboutScnsoft" : "<p>I am a Scinesoft overview<p>"
    }
  ]
}